
class Study_04{

    public static void main(String[] args){

        //配列
        //配列のインデックス番号は０から始まりキーとも呼びます。
        //複数の要素の場合はカンマで区切ります。


        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/


        //配列の定義１
        //配列の定義には変数の定義し、変数名の後に[]を記述します。
        //配列名 = new 格納するデータ型[要素数];

        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //文字列を格納する配列

        // String Fruits[];
        // Fruits = new String[3];

        // Fruits[0] = "Apple";
        // Fruits[1] = "Orange";
        // Fruits[2] = "Grape";

        // System.out.println(Fruits[0]);
        // System.out.println(Fruits[1]);
        // System.out.println(Fruits[2]);

        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //数値を格納する配列

        // int Fruits[];
        // Number = new int[5];

        // Number[0] = 10;
        // Number[1] = 20;
        // Number[2] = 30;
        // Number[3] = 40;
        // Number[4] = 50;

        // System.out.println(Number[0]);
        // System.out.println(Number[1]);
        // System.out.println(Number[2]);
        // System.out.println(Number[3]);
        // System.out.println(Number[4]);


        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //配列の定義２
        //データ型[] 配列名 = {要素 , 要素, 要素}

        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //文字列を格納する配列

        // String[] Fruits = {"Apple","Orange","Grape"};
        // System.out.println(Fruits[0]);
        // System.out.println(Fruits[1]);
        // System.out.println(Fruits[2]);


        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //数値を格納する配列

        // int[] Number = {10 , 20 , 30 , 40 , 50};

        // System.out.println(Number[0]);
        // System.out.println(Number[1]);
        // System.out.println(Number[2]);
        // System.out.println(Number[3]);
        // System.out.println(Number[4]);


        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/


        //配列は複数の変数を格納することも可能です。

        // String apple = "Apple";
        // String orange = "Orange";
        // String grape = "Grape";

        // String[] Fruits = {apple , orange , grape};

        // System.out.println(Fruits[0]);
        // System.out.println(Fruits[1]);
        // System.out.println(Fruits[2]);


        // int num1 = 10;
        // int num2 = 20;
        // int num3 = 30;
        // int num4 = 40;
        // int num5 = 50;

        // int[] Number = {num1 ,num2 ,num3 ,num4 ,num5};

        // System.out.println(Number[0]);
        // System.out.println(Number[1]);
        // System.out.println(Number[2]);
        // System.out.println(Number[3]);
        // System.out.println(Number[4]);


        /*--------------------------------------------------------------------------------*/
        /*--------------------------------------------------------------------------------*/

        //コンパイル時の文字化け対処　javac -encoding utf-8
    }
}