
class Study_09{

    public static void main(String[] args){

        // 繰り返し処理を終了するためには、条件をfalseにする以外に、breakを使って強制的に終了させる方法があります。
        // if文などの条件分岐と組み合わせることで、任意の箇所で繰り返し処理を終了させることができます。


        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        // for(int i = 1; i <= 100; i++){
            
        //     if(i > 50){
        //         break;
        //     }

        //     System.out.println(i + "回目");
        // }


        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        //コンパイル時の文字化け対処　javac -encoding utf-8
    }
}