
class Study_07{

     public static void main(String[] args){

         /*------------------------------------------------------------------------------------*/
         /*------------------------------------------------------------------------------------*/

          // int age = 20;
          // switch (age) {

          //      case 20:
          //      System.out.println("成人です。"); //条件とcaseの値が等しい場合の処理
          //      break;

          //      case 0:
          //      System.out.println("赤ん坊です。"); //条件とcaseの値が等しい場合の処理
          //      break;

          //      default:
          //      System.out.println("未成年です。"); //条件とcaseの値が等しい場合の処理
          //      break;
          // }

          /*------------------------------------------------------------------------------------*/
          /*------------------------------------------------------------------------------------*/


          // int num1 = 20;
          // int num2 = 30;
          // switch (num1 + num2) {

          //      case 10:
          //      System.out.println("答えは１０です。");
          //      break;

          //      case 20:
          //      System.out.println("答えは２０です。");
          //      break;

          //      case 30:
          //      System.out.println("答えは３０です。");
          //      break;

          //      case 40:
          //      System.out.println("答えは４０です。");
          //      break;

          //      case 50:
          //      System.out.println("答えは５０です。");
          //      break;

          //      default:
          //      System.out.println("それ以外です。");
          //      break;
          // }


          /*------------------------------------------------------------------------------------*/
          /*------------------------------------------------------------------------------------*/


          //コンパイル時の文字化け対処　javac -encoding utf-8



     }
}

