
class Study_06{
    
    public static void main(String[] args){

        //if文
        //if文を使うことで、条件に応じて処理を変えることができます。

        //書き方

        // if(条件式){
        //     条件が成立する場合の処理;
        // }

        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        // int age = 20;

        // if(age >= 20){
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("成人です。"); 
        // }


        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        //else文

        //else文を用いることでif文の条件に該当しなっかた場合の処理を追加することができます。
        //else文は必要がなければ記述する必要はありません。

        //書き方

        // if(条件式){
        //     条件が成立する場合の処理;
        // }else{
        //     条件が該当しなかった場合の処理
        // }

        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/

        // int age = 18;

        // if(age >= 20){
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("成人です。"); 
        // }else{
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("未成年です。"); 
        // }


        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        //elseif文
        //elseif文はif文に加えて条件を定義することが可能です。
        //また、ifelse文は複数記述することが可能です。

        //書き方

        // if(条件式１){
        //     条件が成立する場合の処理;
        // }else if(条件式２){
        //     条件２が成立する場合の処理;
        // }else{
        //     すべての条件が成立しない場合の処理;
        // }

        
        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/

        // int age = 0;

        // if(age >= 20){
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("成人です。"); 
        // }else if(age == 0){
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("赤ん坊です。"); 
        // }else{
        //     System.out.println("年齢は" + age + "です。"); 
        //     System.out.println("未成年です。"); 
        // }


        /*------------------------------------------------------------------------------------*/
        /*------------------------------------------------------------------------------------*/


        //コンパイル時の文字化け対処　javac -encoding utf-8

    }
}
